Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_sci.c
          if (__HAL_SCI_GET_FLAG(hsci, SCI_FLAG_IDLE) == SET)
          {
            /* Clear IDLE Flag */
            __HAL_SCI_CLEAR_IDLEFLAG(hsci);
          }

#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
          /*Call registered Rx Event callback*/
          hsci->RxEventCallback(hsci, hsci->RxXferSize);
#else
          /*Call legacy weak Rx Event callback*/
          HAL_SCIEx_RxEventCallback(hsci, hsci->RxXferSize);
#endif /* (USE_HAL_SCI_REGISTER_CALLBACKS) */
        }
        else
        {
          /* Standard reception API called */
#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
          /*Call registered Rx complete callback*/
          hsci->RxCpltCallback(hsci);
#else
          /* Call legacy weak Rx Complete Callback */
          HAL_SCI_RxCpltCallback(hsci);
#endif /* USE_HAL_SCI_REGISTER_CALLBACKS */
        }
      }
    }
    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rxdatacount = hsci->RxXferCount;
    if (((rxdatacount != 0U)) && (rxdatacount < hsci->NbRxDataToProcess))
    {
      /* Disable the SCI RXFT interrupt*/
      CLEAR_BIT(hsci->Instance->CR3, USART_CR3_RXFTIE);

      /* Update the RxISR function pointer */
      hsci->RxISR = SCI_RxSR_8BIT;

      /* Enable the SCI Data Register Not Empty interrupt */
      SET_BIT(hsci->Instance->CR1, USART_CR1_RXNEIE);
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    __HAL_SCI_SEND_REQ(hsci, SCI_RXDATA_FLUSH_REQUEST);
  }
}

/**
  * @brief  Simplex receive an amount of data in non-blocking mode.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_SCI_Receive_IT().
  * @note   ISR function executed when FIFO mode is enabled and when the
  *         data word length is 9 bits long.
  * @param  hsci SCI handle
  * @retval None
  */
static void SCI_RxSR_16BIT_FIFOEN(SCI_HandleTypeDef *hsci)
{
  uint16_t *tmp;
  uint16_t uhMask = hsci->Mask;
  uint16_t uhdata;
  uint32_t nb_rx_data;
  uint32_t rxdatacount;

  /* Check that a Tx process is ongoing */
  if (hsci->RxState == HAL_SCI_STATE_BUSY_RX)
  {
    for (nb_rx_data = hsci->NbRxDataToProcess ; nb_rx_data > 0U ; nb_rx_data--)
    {
      uhdata = (uint16_t) READ_REG(hsci->Instance->DR);
      tmp = (uint16_t *) hsci->pRxBuffPtr;
      *tmp = (uint16_t)(uhdata & uhMask);
      hsci->pRxBuffPtr += 2U;
      hsci->RxXferCount--;

      if (hsci->RxXferCount == 0U)
      {
        /* Disable the SCI Parity Error Interrupt */
        CLEAR_BIT(hsci->Instance->CR1, USART_CR1_PEIE);

        /* Disable the SCI Error Interrupt: (Frame error, noise error, overrun error)
           and RX FIFO Threshold interrupt */
        CLEAR_BIT(hsci->Instance->CR3, (USART_CR3_EIE | USART_CR3_RXFTIE));

        /* Rx process is completed, restore hsci->gState to Ready */
        hsci->RxState = HAL_SCI_STATE_READY;
        
        /* Clear RxISR function pointer */
        hsci->RxISR = NULL;

        /* Initialize type of RxEvent to Transfer Complete */
        hsci->RxEventType = HAL_SCI_RXEVENT_TC;

        /* Check that USART RTOEN bit is set */
        if (READ_BIT(hsci->Instance->CR2, USART_CR2_RTOEN) != 0U)
        {
          /* Enable the SCI Receiver Timeout Interrupt */
          ATOMIC_CLEAR_BIT(hsci->Instance->CR3, USART_CR3_RTOIE);
        }

        /* Check current reception Mode :
           If Reception till IDLE event has been selected : */
        if (hsci->ReceptionType == HAL_SCI_RECEPTION_TOIDLE)
        {
          /* Set reception type to Standard */
          hsci->ReceptionType = HAL_SCI_RECEPTION_STANDARD;

          /* Disable IDLE interrupt */
          ATOMIC_CLEAR_BIT(hsci->Instance->CR1, USART_CR1_IDLEIE);

          if (__HAL_SCI_GET_FLAG(hsci, SCI_FLAG_IDLE) == SET)
          {
            /* Clear IDLE Flag */
            __HAL_SCI_CLEAR_IDLEFLAG(hsci);
          }

#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
          /*Call registered Rx Event callback*/
          hsci->RxEventCallback(hsci, hsci->RxXferSize);
#else
          /*Call legacy weak Rx Event callback*/
          HAL_SCIEx_RxEventCallback(hsci, hsci->RxXferSize);
#endif /* (USE_HAL_SCI_REGISTER_CALLBACKS) */
        }
        else
        {
          /* Standard reception API called */
#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
          /*Call registered Rx complete callback*/
          hsci->RxCpltCallback(hsci);
#else
          /* Call legacy weak Rx Complete Callback */
          HAL_SCI_RxCpltCallback(hsci);
#endif /* USE_HAL_SCI_REGISTER_CALLBACKS */
        }
      }
    }

    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rxdatacount = hsci->RxXferCount;
    if (((rxdatacount != 0U)) && (rxdatacount < hsci->NbRxDataToProcess))
    {
      /* Disable the SCI RXFT interrupt*/
      CLEAR_BIT(hsci->Instance->CR3, USART_CR3_RXFTIE);

      /* Update the RxISR function pointer */
      hsci->RxISR = SCI_RxSR_16BIT;

      /* Enable the SCI Data Register Not Empty interrupt */
      SET_BIT(hsci->Instance->CR1, USART_CR1_RXNEIE);
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    __HAL_SCI_SEND_REQ(hsci, SCI_RXDATA_FLUSH_REQUEST);
  }
}

/**
  * @}
  */
#endif /* HAL_SCI_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
/**
  * @}
  */
/************************ (C) COPYRIGHT Puya *****END OF FILE****/
